Terraform version:
Terraform v0.12.6
+ provider.tencentcloud v1.16.0

Affected Resource:
tencentcloud_cvm

config files:
resource "tencentcloud_instance" "test" {
    allocate_public_ip         = true
    availability_zone          = "ap-shanghai-2"
    image_id                   = "img-pi0ii46r"
    instance_name              = "Unnamed"
    instance_type              = "S4.SMALL2"
    internet_max_bandwidth_out = 1
    private_ip                 = "172.17.0.16"
    security_groups            = [
        "sg-85ei5m7e",
    ]
    subnet_id                  = "subnet-bq3v2fsr"
    system_disk_size           = 50
    system_disk_type           = "CLOUD_PREMIUM"
    vpc_id                     = "vpc-khdn2ary"
    tags = {
      projectname="test-project"
      ownername="yulei"
}
}

Expected behaviour:

tencent-cloud terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.test will be created
  + resource "tencentcloud_instance" "test" {
      + allocate_public_ip         = true
      + availability_zone          = "ap-shanghai-2"
      + id                         = (known after apply)
      + image_id                   = "img-pi0ii46r"
      + instance_name              = "Unnamed"
      + instance_status            = (known after apply)
      + instance_type              = "S4.SMALL2"
      + internet_max_bandwidth_out = 1
      + key_name                   = (known after apply)
      + private_ip                 = "172.17.0.16"
      + public_ip                  = (known after apply)
      + security_groups            = [
          + "sg-85ei5m7e",
        ]
      + subnet_id                  = "subnet-bq3v2fsr"
      + system_disk_size           = 50
      + system_disk_type           = "CLOUD_PREMIUM"
      + tags                       = {
          + "ownername"   = "yulei"
          + "projectname" = "test-project"
        }
      + vpc_id                     = "vpc-khdn2ary"

      + data_disks {
          + data_disk_size       = (known after apply)
          + data_disk_type       = (known after apply)
          + delete_with_instance = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Actual Behavior:
➜  tencent-cloud terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.test will be created
  + resource "tencentcloud_instance" "test" {
      + allocate_public_ip         = true
      + availability_zone          = "ap-shanghai-2"
      + id                         = (known after apply)
      + image_id                   = "img-pi0ii46r"
      + instance_name              = "Unnamed"
      + instance_status            = (known after apply)
      + instance_type              = "S4.SMALL2"
      + internet_max_bandwidth_out = 1
      + key_name                   = (known after apply)
      + private_ip                 = "172.17.0.16"
      + public_ip                  = (known after apply)
      + security_groups            = [
          + "sg-85ei5m7e",
        ]
      + subnet_id                  = "subnet-bq3v2fsr"
      + system_disk_size           = 50
      + system_disk_type           = "CLOUD_PREMIUM"
      + tags                       = {
          + "ownername"   = "yulei"
          + "projectname" = "test-project"
        }
      + vpc_id                     = "vpc-khdn2ary"

      + data_disks {
          + data_disk_size       = (known after apply)
          + data_disk_type       = (known after apply)
          + delete_with_instance = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_instance.test: Creating...

Error: tencentcloud_instance got error, code:InvalidTagKey.Reserved, message:The specified tagKey is Reserved., request id:013ec71c-233a-4ae9-8c0b-2399b04f361a

  on tencentcloud.tf line 2, in resource "tencentcloud_instance" "test":
   2: resource "tencentcloud_instance" "test" {


